# --------------------------------------------------------
# range() - 숫자를 순서대로 만들기
# --------------------------------------------------------

# 20260806의 s2.py에 이어서

for i in range(5):
    print(i)  # 0 1 2 3 4 -> 5는 포함되지 않음

# range(끝) -> 0부터 끝-1까지
# range(시작, 끝) -> 시작부터 끝-1까지
# range(시작, 끝, 간격) -> 시작부터 설정한 간격만큼 건너뛰면서 끝-1까지

print(list(range(5)))  # range()의 결과를 눈으로 보기 위해
print(list(range(1, 6)))  # [1, 2, 3, 4, 5]
print(list(range(1, 10, 2)))  # [1, 3, 5, 7, 9]

# 끝 값이 포함되지 않음에 늘 주의!
for i in range(1, 5):
    print(i)  # 1 2 3 4

for i in range(1, 6):
    print(i)  # 1 2 3 4 5 -> 1부터 5까지 출력되기를 원한다면 끝 값 + 1

for i in range(3):
    print("안녕")


# --------------------------------------------------------
# 합 누적(가장 중요한 패턴)
# --------------------------------------------------------

# 반복하면서 결과를 쌓아 나가는 방식
# 시그마
# 확실히 익혀둘 것!

numbers = [10, 20, 30, 40]
total = 0  # 저장할 변수를 먼저 만들기(0부터 시작)
for n in numbers:
    total += n  # 꺼낸 값을 계속 더함
print(total)  # 100 -> 10 + 20 + 30 + 40
# 동작 과정
# 시작 total = 0
# 1회차 total = 0 + 10
# 2회차 total = 10 + 20
# 3회차 total = 30 + 30
# 4회차 total = 60 + 40
# 출력 -> 100

hund_sum = 0
for i in range(1, 101):  # 1부터 100까지 더하기
    hund_sum += i
print(hund_sum)

# total = 0을 반복 분 안에 두면 매번 결과 리셋!
for i in numbers:
    total = 0
    total += i
print(total)  # 40


# --------------------------------------------------------
# 곱셈 누적
# --------------------------------------------------------

# 곱셈 누적은 반드시 1로 시작!
result = 1  # 초기값을 0으로 설정하면 계속 0
for i in range(1, 6):
    result *= i  # 1 2 6 24 120
print(result)  # 120


# --------------------------------------------------------
# 개수 세기
# --------------------------------------------------------

count = 0
scores = [90, 55, 77, 40, 88]
for score in scores:
    if score >= 60:
        count += 1
print(f"합격자는 총 {count}명 입니다.")


# --------------------------------------------------------
# 리스트에 모으기
# --------------------------------------------------------

events = []
for i in range(1, 11):
    if i % 2 == 0:
        events.append(i)
print(events)


# --------------------------------------------------------
# max()를 이용해 최대값 직접 찾기
# --------------------------------------------------------

scores = [90, 92, 85, 77, 92, 60]
biggest = scores[0]  # 첫 값을 가장 큰 값이라고 설정
for s in scores:
    if s > biggest:
        biggest = s
print(biggest)

numbers = [44, 22, 66, 11, 677, 22]
mini = numbers[0]
for m in numbers:
    if m < mini:
        mini = m
print(mini)


# --------------------------------------------------------
# break / continue
# --------------------------------------------------------

for i in range(1, 10):
    if i == 5:
        break  # 반복을 즉시 중단
    print(i)

for i in range(1, 6):
    if i == 3:
        continue
    print(i)  # 해당 값을 건너 뛰고 반복

# break 반복문 전체 종료
# continue 해당 회차만 skip


# --------------------------------------------------------
# 중첩 반복문
# --------------------------------------------------------

for i in range(2, 10):
    for j in range(1, 10):
        print(f"{i} X {j} = {i * j}")

# 삼각형 만들기
n = 5

for i in range(1, n + 1):
    print("*" * i)  # 왼쪽 직각삼각형

for i in range(1, n + 1):
    print(" " * (n - i) + "*" * (2 * i - 1))  # 피라미드


# 역삼각형
n = 5
for i in range(n, 0, -1):
    print(" " * (n - i) + "*" * (2 * i - 1))


# 역구구단
for i in range(9, 0, -1):
    for j in range(9, 0, -1):
        print(f"{i} X {j} = {i * j}")


# 다이아몬드
n = 5
for i in range(1, 2 * n):
    if i <= 5:
        print(" " * (n - i) + "*" * (2 * i - 1))
    else:
        j = n * 2 - i
        print(" " * (n - j) + "*" * (2 * j - 1))

        # 6회차 : 공1 *7 -> i = 6인데 얘로 별 7개
        # 7회차 : 공2 *5 -> i = 7인데 얘로 별 5개
        # 8회차 : 공3 *3 -> i = 8인데 얘로 별 3개
        # 9회차 : 공5 *1 -> i = 9인데 얘로 별 1개


# --------------------------------------------------------
# 알아두면 좋은 기능
# --------------------------------------------------------

fruits = ["사과", "바나나", "포도"]
for i, x in enumerate(fruits):  # 번호와 값을 함께 출력
    print(f"{i + 1}번 : {x}")  # 0 부터 시작함에 주의!

for i, x in enumerate(fruits, 1):
    print(f"{i}번 : {x}")

names = ["철수", "영희"]
ages = [25, 22]
for name, age in zip(names, ages):
    print(f"{name} : {age}")


# --------------------------------------------------------
# 시그마(Σ)
# --------------------------------------------------------

# 시그마 : 전부 차례대로 더하라

# 기호 해부
#       10      -> 끝값 : 어디까지
#       Σ i     -> i : 무엇을 더할 것인가
#      i = 1    -> 시작값 : 어디서부터
# i는 1부터 시작해서 하나씩 늘려가며 10까지 전부 더하라

sum = 0
for i in range(1, 11):
    sum += i
print(sum)

# Σ i^2 -> 1^2 + 2^2 + 3^2 + ...
# sq = 0
# for i in range(1, 11):
#   sq += i**2

# Σ 2i -> 1*2 + 2*2 + 3*2 + ...
# d = 0
# for i in range(1, 11):
#    d += i * 2

# Σ 3 -> 3 + 3 + 3+ ...
# ss = 0
# for i in range(1, 11):
#     ss += 3



